curisama/The-Badge/sdkconfig.defaults
# The chip. Without this a fresh clone configures for plain esp32 and
# fails deep inside TinyUSB, which is a confusing way to find out.
CONFIG_IDF_TARGET="esp32s3"

# This file was generated using idf.py save-defconfig. It can be edited manually.
# Shared ESP-IDF v5.5/v6.0 project minimal configuration
#
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_OBJ_STYLE_CACHE=y

CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# BLE 스택이 IRAM 을 많이 먹는다. LVGL 을 IRAM 에서 빼야 링크가 된다.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
# 원형 화면에서 잘려 보이는 성능 계기판. 개발 중에만 켠다.
CONFIG_LV_USE_SYSMON=n
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_IMGFONT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y



# extra font sizes
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# BLE HID (ESP32-S3 는 클래식 BT 가 없다 — BLE 전용)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_SMP_ENABLE=y

# 전원관리 — 유휴 시 CPU 주파수를 내린다
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# ── 라이트슬립 (0906) ─────────────────────────────────────────
# 틱리스 아이들이 없으면 esp_pm 의 light_sleep_enable 은 아무 일도 안 한다.
# 할 일이 없을 때 CPU 를 재워 대기 전류를 크게 줄인다.
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# ── 뻗은 자리 규명 (0906) ────────────────────────────────────
# 패닉이 나면 스택·레지스터를 coredump 파티션에 통째로 남긴다.
# 꽂아서 `idf.py coredump-info` 하면 어느 파일 몇 번째 줄에서 죽었는지 나온다.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_SHA=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64

# 라이트슬립 중 PSRAM 을 반쯤 재우면, 스택이 PSRAM 에 있는 태스크가 깨어날 때
# 아직 준비 안 된 메모리를 밟는다. LVGL 스택은 내부 RAM 으로 옮겼지만
# 안전판으로 이것도 끈다.
# CONFIG_PM_SLP_SPIRAM_HALFSLEEP_ENABLED is not set
